 Splitting text in columns into separate columns and renaming

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(["Age, First Name   Last Name", 
                  "55, John Smith", 
                  "54, Susan Smith", 
                  "16, Jane Smith",
                  "18, Jack Smith"], columns=['row'])

In [3]:
df1

                           row
0  Age, First Name   Last Name
1               55, John Smith
2              54, Susan Smith
3               16, Jane Smith
4               18, Jack Smith

In [4]:
df1["re"] = df1["row"].apply(lambda x: " ".join(x.split()).split(None, 2, ))

new_header = df1["re"][0]

values = df1["re"][1:]

df = {new_header[0]:[int(values.iloc[i][0].replace(",", "")) for i in range(len(values))], \
     new_header[1]:[values.iloc[i][1].replace(",", "") for i in range(len(values))], \
     new_header[2]:[values.iloc[i][2].replace(",", "") for i in range(len(values))]}

In [5]:
df2 = pd.DataFrame(df)
df2

   Age,  First Name Last Name
0    55   John          Smith
1    54  Susan          Smith
2    16   Jane          Smith
3    18   Jack          Smith

In [6]:
df2.rename(columns = {'Age,' : 'Age'}, inplace = True)

In [7]:
df2

   Age  First Name Last Name
0   55   John          Smith
1   54  Susan          Smith
2   16   Jane          Smith
3   18   Jack          Smith